src/cf/Documents/Продажа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Продажа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/ПартииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Покупка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Documents/Продажа/Ext/ObjectModule.bsl
Перем РежимЗаписиДокументаПродажи;


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаПоДокументу = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	РежимЗаписиДокументаПродажи = РежимЗаписи;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ПартииТоваров Приход
	_Запрос = Новый Запрос;
	_Запрос.Текст =
		"ВЫБРАТЬ
		|	ПродажаТовары.Номенклатура,
		|	СУММА(ПродажаТовары.Количество) КАК Количество,
		|	СУММА(ПродажаТовары.Сумма) КАК Сумма
		|ПОМЕСТИТЬ втПродажа
		|ИЗ
		|	Документ.Продажа.Товары КАК ПродажаТовары
		|ГДЕ
		|	ПродажаТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПартииТоваровОстатки.Номенклатура,
		|	втПродажа.Количество - ПартииТоваровОстатки.КоличествоОстаток КАК НеХватает
		|ИЗ
		|	РегистрНакопления.ПартииТоваров.Остатки(
		|			&МоментВремени,
		|			Номенклатура В
		|				(ВЫБРАТЬ
		|					втПродажа.Номенклатура
		|				ИЗ
		|					втПродажа)) КАК ПартииТоваровОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПродажа КАК втПродажа
		|		ПО ПартииТоваровОстатки.Номенклатура = втПродажа.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПартииТоваровОстатки.Партия КАК Партия,
		|	ПартииТоваровОстатки.Номенклатура КАК Номенклатура,
		|	ПартииТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	втПродажа.Количество КАК Количество,
		|	втПродажа.Сумма КАК Сумма
		|ИЗ
		|	РегистрНакопления.ПартииТоваров.Остатки(
		|			&МоментВремени,
		|			Номенклатура В
		|				(ВЫБРАТЬ
		|					втПродажа.Номенклатура
		|				ИЗ
		|					втПродажа)) КАК ПартииТоваровОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПродажа КАК втПродажа
		|		ПО ПартииТоваровОстатки.Номенклатура = втПродажа.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Партия
		|ИТОГИ
		|	СУММА(КоличествоОстаток),
		|	МАКСИМУМ(Количество),
		|	МАКСИМУМ(Сумма)
		|ПО
		|	Номенклатура
		|АВТОУПОРЯДОЧИВАНИЕ";

	_Запрос.УстановитьПараметр("Ссылка", Ссылка);
	_Запрос.УстановитьПараметр("МоментВремени", МоментВремени());

	РезультатПакет = _Запрос.ВыполнитьПакет();

	Если РезультатПакет[1].Пустой() Тогда
		Отказ = Истина;
		Сообщить("Нет остатков");
		Возврат;
	КонецЕсли;

	Выборка = РезультатПакет[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.НеХватает > 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Товара """ + Выборка.Номенклатура + """ не хватает в количестве " + Выборка.НеХватает;
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			//Сообщить("Товара """ + Выборка.Номенклатура + """ не хватает в количестве " + Выборка.НеХватает);
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;

	Если Отказ Тогда Возврат; КонецЕсли;

	Движения.ПартииТоваров.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;

	ВыборкаНоменклатура = РезультатПакет[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");
	Пока ВыборкаНоменклатура.Следующий() Цикл
		ВыборкаПоПартиям = ВыборкаНоменклатура.Выбрать();
		ОсталосьСписатьКоличество = ВыборкаНоменклатура.Количество;
		Пока ВыборкаПоПартиям.Следующий() И ОсталосьСписатьКоличество <> 0 Цикл
			Списать = Мин(ВыборкаПоПартиям.КоличествоОстаток, ОсталосьСписатьКоличество);

			Движение = Движения.ПартииТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Партия = ВыборкаПоПартиям.Партия;
			Движение.Номенклатура = ВыборкаПоПартиям.Номенклатура;
			Движение.Количество = Списать;

			ОсталосьСписатьКоличество = ОсталосьСписатьКоличество - Списать;
		КонецЦикла;

		// регистр Продажи
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаНоменклатура.Номенклатура;
		Движение.Клиент = Покупатель;
		Движение.Количество = ВыборкаНоменклатура.Количество;
		Движение.Сумма = ВыборкаНоменклатура.Сумма;
		Движение.Акция = Акция;
	КонецЦикла;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если РежимЗаписиДокументаПродажи = РежимЗаписиДокумента.Проведение Тогда
		МодульЗакрытиеМесяца.УстановитьАктуальностьРасчетаСебестоимостиПоПроводимомуДокументу(Дата);
	КонецЕсли;	
КонецПроцедуры
